/* 

 1. 软件分为两大类：
        操作系统：协调，管理，控制就算计硬件资源与应用软件的一个控制程序。
        应用软件：一堆代码文件

 2. 计算机体系的三层结构：
        应用程序
        操作系统
        硬件      

 3. 计算机五大组成部分：
        控制器：计算机指挥系统 负责控制其他硬件的运行 -- 大脑
        运算器：负责数学运算与逻辑运算 -- 大脑
               [控制器+运算器 = cpu]
        存储器：存储数据 
                内存/主存：内存条 基于电存储数据 断电数据丢失 临时保存数据 速度快 
                外存: 磁盘 基于磁盘存储数据 断电不丢失 长久保存数据 速度慢

                cpu内部也有存储器 叫寄存器 跟cpu一样的材质做成 速度超快 没有延迟 
                不是主力存储设备 容量小 断电丢失 用于存储临时运算结果

                计算机越用越卡就是因为内存不足 存储数据越来越多 加内存条
                加快软件启动速度 要先从硬盘读入内存 所以要换快好硬盘 固态硬盘较好 好于机械硬盘
                mac配置的就是固态硬盘 所以启动软件较快
        输入设备：键盘 鼠标
        输出设备：显示器 打印机

    ps：程序的运行与计算机三大核心硬件cpu，内存，硬件的关系
        程序最先存放在磁盘中
        程序的运行经历加载的过程：程序代码 数据从磁盘读入内存 cpu从内存中读取指令运行
        类似于人看一眼文字 大脑记住 然后去做
        cpu不会自发的控制程序运行 ，我们是控制cpu进而控制其他硬件运行

    ps：安装软件都装到硬盘里，不是安装在内存中 断电丢失[大脑失忆]
        软件的运行都是把数据加载到内存中
        所以说
           计算机硬盘的大小决定了能够安装的软件数量，
           计算机的内存大小决定了能够同时运行的软件数量。   

*/
